
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ТоварСуществует(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;	
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

Функция ТоварСуществует(НазваниеТовара)
	
	ТаблицаТоваров = Новый ТаблицаЗначений();
	ТаблицаТоваров.Колонки.Добавить("Название");
	ТаблицаТоваров.Колонки.Добавить("Цена");
	
	СтрТовара = ТаблицаТоваров.Добавить();
	СтрТовара.Название = "Гиатра";
	СтрТовара.Цена	   = 100;
	
	СтрТовара = ТаблицаТоваров.Добавить();
	СтрТовара.Название = "Микрофон";
	СтрТовара.Цена	   = 50;
	
	ТоварСуществует = Справочники.Товары.ТоварСуществуетПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
	
КонецФункции