
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ТоварСуществует(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 найден", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 не найден!", НазваниеТовара);
	КонецЕсли;	
	
	Сообщить(ТекстСообщения);
	
КонецПроцедуры

Функция ТоварСуществует(НазваниеТовара)
	
	ТоварСуществует = Справочники.Товары.ТоварСуществуетПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
	
КонецФункции

